GopalSaraf/Practicals/PSDL/include/proc/pic16lf18326.inc
#define N1EN                             BANKMASK(NCO1CON), 7
#define N1OUT                            BANKMASK(NCO1CON), 5
#define N1PFM                            BANKMASK(NCO1CON), 0
#define N1POL                            BANKMASK(NCO1CON), 4
#define NCO1IE                           BANKMASK(PIE2), 0
#define NCO1IF                           BANKMASK(PIR2), 0
#define NCOMD                            BANKMASK(PMD1), 7
#define NDIV0                            BANKMASK(OSCCON1), 0
#define NDIV1                            BANKMASK(OSCCON1), 1
#define NDIV2                            BANKMASK(OSCCON1), 2
#define NDIV3                            BANKMASK(OSCCON1), 3
#define NOSC0                            BANKMASK(OSCCON1), 4
#define NOSC1                            BANKMASK(OSCCON1), 5
#define NOSC2                            BANKMASK(OSCCON1), 6
#define NOSCR                            BANKMASK(OSCCON3), 3
#define NVMADR0                          BANKMASK(NVMADRL), 0
#define NVMADR1                          BANKMASK(NVMADRL), 1
#define NVMADR10                         BANKMASK(NVMADRH), 2
#define NVMADR11                         BANKMASK(NVMADRH), 3
#define NVMADR12                         BANKMASK(NVMADRH), 4
#define NVMADR13                         BANKMASK(NVMADRH), 5
#define NVMADR14                         BANKMASK(NVMADRH), 6
#define NVMADR2                          BANKMASK(NVMADRL), 2
#define NVMADR3                          BANKMASK(NVMADRL), 3
#define NVMADR4                          BANKMASK(NVMADRL), 4
#define NVMADR5                          BANKMASK(NVMADRL), 5
#define NVMADR6                          BANKMASK(NVMADRL), 6
#define NVMADR7                          BANKMASK(NVMADRL), 7
#define NVMADR8                          BANKMASK(NVMADRH), 0
#define NVMADR9                          BANKMASK(NVMADRH), 1
#define NVMDAT0                          BANKMASK(NVMDATL), 0
#define NVMDAT1                          BANKMASK(NVMDATL), 1
#define NVMDAT10                         BANKMASK(NVMDATH), 2
#define NVMDAT11                         BANKMASK(NVMDATH), 3
#define NVMDAT12                         BANKMASK(NVMDATH), 4
#define NVMDAT13                         BANKMASK(NVMDATH), 5
#define NVMDAT2                          BANKMASK(NVMDATL), 2
#define NVMDAT3                          BANKMASK(NVMDATL), 3
#define NVMDAT4                          BANKMASK(NVMDATL), 4
#define NVMDAT5                          BANKMASK(NVMDATL), 5
#define NVMDAT6                          BANKMASK(NVMDATL), 6
#define NVMDAT7                          BANKMASK(NVMDATL), 7
#define NVMDAT8                          BANKMASK(NVMDATH), 0
#define NVMDAT9                          BANKMASK(NVMDATH), 1
#define NVMIE                            BANKMASK(PIE2), 4
#define NVMIF                            BANKMASK(PIR2), 4
#define NVMMD                            BANKMASK(PMD0), 2
#define NVMREGS                          BANKMASK(NVMCON1), 6
#define ODCA0                            BANKMASK(ODCONA), 0
#define ODCA1                            BANKMASK(ODCONA), 1
#define ODCA2                            BANKMASK(ODCONA), 2
#define ODCA4                            BANKMASK(ODCONA), 4
#define ODCA5                            BANKMASK(ODCONA), 5
#define ODCC0                            BANKMASK(ODCONC), 0
#define ODCC1                            BANKMASK(ODCONC), 1
#define ODCC2                            BANKMASK(ODCONC), 2
#define ODCC3                            BANKMASK(ODCONC), 3
#define ODCC4                            BANKMASK(ODCONC), 4
#define ODCC5                            BANKMASK(ODCONC), 5
#define OERR                             BANKMASK(RC1STA), 1
#define ORDY                             BANKMASK(OSCCON3), 4
#define OSFIE                            BANKMASK(PIE3), 7
#define OSFIF                            BANKMASK(PIR3), 7
#define P5TSEL0                          BANKMASK(PWMTMRS), 0
#define P5TSEL1                          BANKMASK(PWMTMRS), 1
#define P6TSEL0                          BANKMASK(PWMTMRS), 2
#define P6TSEL1                          BANKMASK(PWMTMRS), 3
#define PEIE                             BANKMASK(INTCON), 6
#define PLLR                             BANKMASK(OSCSTAT1), 0
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PWM5DCH0                         BANKMASK(PWM5DCH), 0
#define PWM5DCH1                         BANKMASK(PWM5DCH), 1
#define PWM5DCH2                         BANKMASK(PWM5DCH), 2
#define PWM5DCH3                         BANKMASK(PWM5DCH), 3
#define PWM5DCH4                         BANKMASK(PWM5DCH), 4
#define PWM5DCH5                         BANKMASK(PWM5DCH), 5
#define PWM5DCH6                         BANKMASK(PWM5DCH), 6
#define PWM5DCH7                         BANKMASK(PWM5DCH), 7
#define PWM5DCL0                         BANKMASK(PWM5DCL), 6
#define PWM5DCL1                         BANKMASK(PWM5DCL), 7
#define PWM5EN                           BANKMASK(PWM5CON), 7
#define PWM5MD                           BANKMASK(PMD3), 4
#define PWM5OUT                          BANKMASK(PWM5CON), 5
#define PWM5POL                          BANKMASK(PWM5CON), 4
#define PWM6DCH0                         BANKMASK(PWM6DCH), 0
#define PWM6DCH1                         BANKMASK(PWM6DCH), 1
#define PWM6DCH2                         BANKMASK(PWM6DCH), 2
#define PWM6DCH3                         BANKMASK(PWM6DCH), 3
#define PWM6DCH4                         BANKMASK(PWM6DCH), 4
#define PWM6DCH5                         BANKMASK(PWM6DCH), 5
#define PWM6DCH6                         BANKMASK(PWM6DCH), 6
#define PWM6DCH7                         BANKMASK(PWM6DCH), 7
#define PWM6DCL0                         BANKMASK(PWM6DCL), 6
#define PWM6DCL1                         BANKMASK(PWM6DCL), 7
#define PWM6EN                           BANKMASK(PWM6CON), 7
#define PWM6MD                           BANKMASK(PMD3), 5
#define PWM6OUT                          BANKMASK(PWM6CON), 5
#define PWM6POL                          BANKMASK(PWM6CON), 4
#define RA0                              BANKMASK(PORTA), 0
#define RA0PPS0                          BANKMASK(RA0PPS), 0
#define RA0PPS1                          BANKMASK(RA0PPS), 1
#define RA0PPS2                          BANKMASK(RA0PPS), 2
#define RA0PPS3                          BANKMASK(RA0PPS), 3
#define RA0PPS4                          BANKMASK(RA0PPS), 4
#define RA1                              BANKMASK(PORTA), 1
#define RA1PPS0                          BANKMASK(RA1PPS), 0
#define RA1PPS1                          BANKMASK(RA1PPS), 1
#define RA1PPS2                          BANKMASK(RA1PPS), 2
#define RA1PPS3                          BANKMASK(RA1PPS), 3
#define RA1PPS4                          BANKMASK(RA1PPS), 4
#define RA2                              BANKMASK(PORTA), 2
#define RA2PPS0                          BANKMASK(RA2PPS), 0
#define RA2PPS1                          BANKMASK(RA2PPS), 1
#define RA2PPS2                          BANKMASK(RA2PPS), 2
#define RA2PPS3                          BANKMASK(RA2PPS), 3
#define RA2PPS4                          BANKMASK(RA2PPS), 4
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA4PPS0                          BANKMASK(RA4PPS), 0
#define RA4PPS1                          BANKMASK(RA4PPS), 1
#define RA4PPS2                          BANKMASK(RA4PPS), 2
#define RA4PPS3                          BANKMASK(RA4PPS), 3
#define RA4PPS4                          BANKMASK(RA4PPS), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA5PPS0                          BANKMASK(RA5PPS), 0
#define RA5PPS1                          BANKMASK(RA5PPS), 1
#define RA5PPS2                          BANKMASK(RA5PPS), 2
#define RA5PPS3                          BANKMASK(RA5PPS), 3
#define RA5PPS4                          BANKMASK(RA5PPS), 4
#define RC0                              BANKMASK(PORTC), 0
#define RC0PPS0                          BANKMASK(RC0PPS), 0
#define RC0PPS1                          BANKMASK(RC0PPS), 1
#define RC0PPS2                          BANKMASK(RC0PPS), 2
#define RC0PPS3                          BANKMASK(RC0PPS), 3
#define RC0PPS4                          BANKMASK(RC0PPS), 4
#define RC1                              BANKMASK(PORTC), 1
#define RC1PPS0                          BANKMASK(RC1PPS), 0
#define RC1PPS1                          BANKMASK(RC1PPS), 1
#define RC1PPS2                          BANKMASK(RC1PPS), 2
#define RC1PPS3                          BANKMASK(RC1PPS), 3
#define RC1PPS4                          BANKMASK(RC1PPS), 4
#define RC2                              BANKMASK(PORTC), 2
#define RC2PPS0                          BANKMASK(RC2PPS), 0
#define RC2PPS1                          BANKMASK(RC2PPS), 1
#define RC2PPS2                          BANKMASK(RC2PPS), 2
#define RC2PPS3                          BANKMASK(RC2PPS), 3
#define RC2PPS4                          BANKMASK(RC2PPS), 4
#define RC3                              BANKMASK(PORTC), 3
#define RC3PPS0                          BANKMASK(RC3PPS), 0
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC5PPS0                          BANKMASK(RC5PPS), 0
#define RC5PPS1                          BANKMASK(RC5PPS), 1
#define RC5PPS2                          BANKMASK(RC5PPS), 2
#define RC5PPS3                          BANKMASK(RC5PPS), 3
#define RC5PPS4                          BANKMASK(RC5PPS), 4
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(NVMCON1), 0
#define ROI                              BANKMASK(CPUDOZE), 5
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define RXDTPPS0                         BANKMASK(RXPPS), 0
#define RXDTPPS1                         BANKMASK(RXPPS), 1
#define RXDTPPS2                         BANKMASK(RXPPS), 2
#define RXDTPPS3                         BANKMASK(RXPPS), 3
#define RXDTPPS4                         BANKMASK(RXPPS), 4
#define SBOREN                           BANKMASK(BORCON), 7
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SOR                              BANKMASK(OSCSTAT1), 3
#define SOSCBE                           BANKMASK(OSCCON3), 5
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SPEN                             BANKMASK(RC1STA), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP2ADD0                         BANKMASK(SSP2ADD), 0
#define SSP2ADD1                         BANKMASK(SSP2ADD), 1
#define SSP2ADD2                         BANKMASK(SSP2ADD), 2
#define SSP2ADD3                         BANKMASK(SSP2ADD), 3
#define SSP2ADD4                         BANKMASK(SSP2ADD), 4
#define SSP2ADD5                         BANKMASK(SSP2ADD), 5
#define SSP2ADD6                         BANKMASK(SSP2ADD), 6
#define SSP2ADD7                         BANKMASK(SSP2ADD), 7
#define SSP2BUF0                         BANKMASK(SSP2BUF), 0
#define SSP2BUF1                         BANKMASK(SSP2BUF), 1
#define SSP2BUF2                         BANKMASK(SSP2BUF), 2
#define SSP2BUF3                         BANKMASK(SSP2BUF), 3
#define SSP2BUF4                         BANKMASK(SSP2BUF), 4
#define SSP2BUF5                         BANKMASK(SSP2BUF), 5
#define SSP2BUF6                         BANKMASK(SSP2BUF), 6
#define SSP2BUF7                         BANKMASK(SSP2BUF), 7
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4
#define SSP2IE                           BANKMASK(PIE2), 3
#define SSP2IF                           BANKMASK(PIR2), 3
#define SSP2MSK0                         BANKMASK(SSP2MSK), 0
#define SSP2MSK1                         BANKMASK(SSP2MSK), 1
#define SSP2MSK2                         BANKMASK(SSP2MSK), 2
#define SSP2MSK3                         BANKMASK(SSP2MSK), 3
#define SSP2MSK4                         BANKMASK(SSP2MSK), 4
#define SSP2MSK5                         BANKMASK(SSP2MSK), 5
#define SSP2MSK6                         BANKMASK(SSP2MSK), 6
#define SSP2MSK7                         BANKMASK(SSP2MSK), 7
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4
#define STKOVF                           BANKMASK(PCON0), 7
#define STKUNF                           BANKMASK(PCON0), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TX1STA), 4
#define SYSCMD                           BANKMASK(PMD0), 7
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0OUTPS0                         BANKMASK(T0CON0), 0
#define T0OUTPS1                         BANKMASK(T0CON0), 1
#define T0OUTPS2                         BANKMASK(T0CON0), 2
#define T0OUTPS3                         BANKMASK(T0CON0), 3
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1SOSC                           BANKMASK(T1CON), 3
#define T1SYNC                           BANKMASK(T1CON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GCON), 0
#define T3GSS1                           BANKMASK(T3GCON), 1
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3SOSC                           BANKMASK(T3CON), 3
#define T3SYNC                           BANKMASK(T3CON), 2
#define T4CKPS0                          BANKMASK(T4CON), 0
#define T4CKPS1                          BANKMASK(T4CON), 1
#define T4OUTPS0                         BANKMASK(T4CON), 3
#define T4OUTPS1                         BANKMASK(T4CON), 4
#define T4OUTPS2                         BANKMASK(T4CON), 5
#define T4OUTPS3                         BANKMASK(T4CON), 6
#define T5CKPS0                          BANKMASK(T5CON), 4
#define T5CKPS1                          BANKMASK(T5CON), 5
#define T5GGO_nDONE                      BANKMASK(T5GCON), 3
#define T5GPOL                           BANKMASK(T5GCON), 6
#define T5GSPM                           BANKMASK(T5GCON), 4
#define T5GSS0                           BANKMASK(T5GCON), 0
#define T5GSS1                           BANKMASK(T5GCON), 1
#define T5GTM                            BANKMASK(T5GCON), 5
#define T5GVAL                           BANKMASK(T5GCON), 2
#define T5SOSC                           BANKMASK(T5CON), 3
#define T5SYNC                           BANKMASK(T5CON), 2
#define T6CKPS0                          BANKMASK(T6CON), 0
#define T6CKPS1                          BANKMASK(T6CON), 1
#define T6OUTPS0                         BANKMASK(T6CON), 3
#define T6OUTPS1                         BANKMASK(T6CON), 4
#define T6OUTPS2                         BANKMASK(T6CON), 5
#define T6OUTPS3                         BANKMASK(T6CON), 6
#define TMR00                            BANKMASK(TMR0L), 0
#define TMR01                            BANKMASK(TMR0L), 1
#define TMR010                           BANKMASK(TMR0H), 2
#define TMR011                           BANKMASK(TMR0H), 3
#define TMR012                           BANKMASK(TMR0H), 4
#define TMR013                           BANKMASK(TMR0H), 5
#define TMR014                           BANKMASK(TMR0H), 6
#define TMR015                           BANKMASK(TMR0H), 7
#define TMR02                            BANKMASK(TMR0L), 2
#define TMR03                            BANKMASK(TMR0L), 3
#define TMR04                            BANKMASK(TMR0L), 4
#define TMR05                            BANKMASK(TMR0L), 5
#define TMR06                            BANKMASK(TMR0L), 6
#define TMR07                            BANKMASK(TMR0L), 7
#define TMR08                            BANKMASK(TMR0H), 0
#define TMR09                            BANKMASK(TMR0H), 1
#define TMR0IE                           BANKMASK(PIE0), 5
#define TMR0IF                           BANKMASK(PIR0), 5
#define TMR0MD                           BANKMASK(PMD1), 0
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
